---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetLinear
source: html/5c8ced09-06c7-7d23-0f24-01feacb35237.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryParamPresetLinear Property

"State"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryParamPresetLinear { get; }
```